const saveInstitutes = require('../saveDisciplinas/saveInstitute');
const saveDisciplinas = require('../saveDisciplinas/savedsiciplina');
const saveOPDS = require('../saveDisciplinas/saveOpds');

let instituteName = {name:'ВІТІ'};
let mas = [{name:'основ кримінального кодексу щодо військових злочинів та відповідальності за них'},
    {name:'основ міжнародного гуманітарного права'},
    {name:'Статутів Збройних Сил України'},
    {name:'підтримувати підрозділ у стані постійної бойової готовності'},
    {name:'планувати, організовувати та контролювати повсякденну діяльність підрозділу'},
    {name:'управляти повсякденною діяльністю підрозділу через підпорядкований сержантський склад'},
    {name:'здійснювати підготовку та управляти підрозділом під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'приймати обґрунтовані рішення в складній обстановці під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'вести (відпрацьовувати) бойові (звітні) документи'},
    {name:'організовувати і вести розвідку під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'організовувати і підтримувати стійкий звязок під час під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'здійснювати заходи з інженерної підготовки підрозділу під час підготовки та в ході виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'здійснювати РХБ захист дій підрозділу під час під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'здійснювати заходи з топогеодезичного забезпечення дій підрозділу  під час під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'організовувати заходи ППО та маскування підрозділу'},
    {name:'здійснювати заходи з медичного забезпечення дій підрозділу під час під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'організовувати взаємодію з іншими підрозділами'},
    {name:'володіння штатним озброєнням та військовою технікою'},
    {name:'організовувати експлуатацію озброєння та військової техніки (обслуговування та ремонт) під час під час виконання бойових (спеціальних) завдань, проведення навчань, занять'},
    {name:'виховувати у підлеглих патріотизм та любов до Батьківщини'},
    {name:'виховувати особовий склад та зміцнювати військову дисципліну у підпорядкованому підрозділі'},
    {name:'проводити навчальні заняття з особовим складом підпорядкованого підрозділу з дотриманням заходів безпеки'},
    {name:'здатність до мотивації особового складу на успішне виконання завдання'},
    {name:'вміння працювати в команді'},
    {name:'особиста дисциплінованість, стресостійкість та витривалість'},
    {name:'швидко реагувати на ризькі зміни в бойовій (навчальній) обстановці'}];

let masOPDS = [{name:'Морально-психологічне забезпечення підготовки та застосування Збройних Сил України'},
    {name:'3агальна тактика'},
    {name:'Основи військового управління (у тому числі штабні процедури НАТО)'},
    {name:'Управління повсякденною діяльністю підрозділів (у тому числі охорона державної таємниці, безпека життєдіяльності, основи охорони праці, безпека військової діяльності)'},
    {name:'Радіаційний, хімічний, біологічний захист підрозділів   (у тому числі екологія)'},
    {name:'Військова топографія'},
    {name:'Інженерна підготовка'},
    {name:'Організація військового зв’язку,'},
    {name:'Бойова система виживання воїнів (у тому числі тактична медицина)'},
    {name:'Статути Збройних Сил України та їх практичне застосування (у тому числі стройова підготовка)'},
    {name:'Стрілецька зброя та вогнева підготовка'},
    {name:'Фізичне виховання та спеціальна фізична підготовка'},
    {name:'Іноземна мова (загальний, загальновійськовий та спеціальний курс)'},
    {name:'Правознавство (у тому числі основи військового законодавства та міжнародне гуманітарне право, морське право для спеціальностей підготовки військових фахівців морського профілю)'},
    {name:'Військова педагогіка та психологія (у тому числі лідерство)'}];


module.exports = async function () {
    try{
        await saveInstitutes(instituteName.name);
        for(let i =0;i<mas.length;i++){
            await saveDisciplinas(mas[i].name);
        }
        for(let i=0;i<masOPDS.length;i++){
            await saveOPDS(masOPDS[i].name);
        }
        return true;
    }
    catch (e) {
        return e
    }
};